// - Користувач вводить або має два числа.
//     Потрібно знайти та вивести максимальне число з тих двох .
//     Також потрібно врахувати коли введені рівні числа.
alert('Давайте перевіримо яке з двох чисел більше!');
let num1 = +prompt('Оберіть перше число');
let num2 = +prompt('Оберіть друге число');
if (num1 > num2){
    document.write(`<h3> ${num1} <h3>`);
} else if (num1 === num2){
    document.write(`<h3> ${num1} = ${num2} <h3>`);
} else {
    document.write(`<h3> ${num2} <h3>`);
}

//
//
// - У першому під'їзді квартири з 1 до 20. У другому з 21 по 48. У третьому з 49 по 90.
// Користувач вводить номер квартири просто в змінні або через prompt('') .
//     Програма повинна зазначити, в якому під'їзді знаходиться дана квартира.
let homeNumber = +prompt('Введіть номер квартири');
if (homeNumber > 0 && homeNumber <= 20) {
    document.write(`<h3>${homeNumber} квартира знаходиться у першому під\'їзді</h3>`);
} else if(homeNumber >= 21 && homeNumber <= 48) {
    document.write(`<h3>${homeNumber} квартира знаходиться у другому під\'їзді</h3>`);
}else if (homeNumber >= 49 && homeNumber <= 90) {
    document.write(`<h3>${homeNumber} квартира знаходиться у третьому під\'їзді</h3>`);
}else {
    document.write(`<h3>Нажаль квартири з цим номером (${homeNumber}) немає в нашому будинку. Спробуйте ще раз!</h3>`);
}

// - Ми маємо змінну number в яку користувач задає числове значення,  якщо змінна рівна 10 вивести повідомлення ВІРНО, якщо змінна не рівна 10 - тоді НЕВІРНО
let number = 10;
if (number === 10) {
    console.log('ВІРНО');
} else {
    console.log('НЕ ВІРНО');
}
number = 9 === 10 ? console.log('ВІРНО') : console.log('НЕ ВІРНО');
//
// - Ми маємо змінну x в яку користувач задає  значення,  якщо в змінну записане число, вивести 1,
//     якщо в змінну записали стрінгу вивести 2, якщо булеве значення - 3, якщо об'єкт або масив - 3.
// якщо в змінну записали щось інше, спрацьовує else
let typeData = !!'';
if (typeof typeData === 'number') {
    console.log(1);
} else if (typeof typeData === 'string') {
    console.log(2);
} else if (typeof typeData === 'boolean' || typeof typeData === 'object') {
    console.log(3);
} else {
    console.log('error');
}

// - Задача-гра "чи ми йдемо сьогодні в OKTEN на навчання?".
//     Змінна, яка характеризує температуру. Якщо температура від +10 до +22 вивести повідомлення що ми йдемо ВЧИТИСЯ .
//     Якщо інша темпаретура, тоді виводимо повідомлення що сидимо вдома і вчимося ОНЛАЙН
alert('чи ми йдемо сьогодні в OKTEN на навчання?');
let temp = +prompt('Скільки зараз градусів тепла на вулиці?');
if (temp >= 10 && temp <= 22) {
    confirm('Їдемо вчитися в офіс');
} else {
    confirm('Сидимо вдома і вчимося онлайн');
}

let blohin = (temp >= 10) && (temp <= 22) ? 'camon play' : 'будем разбираться';
console.log(blohin);

// - За допомогою switch case - реалізувати гру - вікторину, де ми вводимо число від 1 до 5. І взалежності від введеного
//     числа нам дається приз. (Авто, Мото, Телефон, і т.д ) і якщо число не підходить тоді  вивести Повідомлення - що число не вірне ... .

let luckyNumber = +prompt("Хочете зіграти в гру? Спробуйте ввести число від 1 до 5");
switch (luckyNumber) {
    case 1 :
        document.write(`<h2> Ура! Ви виграли автомобіль! </h2>`);
        break;
    case 2 :
        document.write(`<h2> Ура! Ви виграли мопед! </h2>`);
        break;
    case 3 :
        document.write(`<h2> Ура! Ви виграли жакет! </h2>`);
        break;
    case 4 :
        document.write(`<h2> Ура! Ви виграли кашкет! </h2>`);
        break;
    case 5 :
        document.write(`<h2> Ура! Ви виграли паштет! </h2>`);
        break;
    default:
        alert(`Ви не виконали умови вікторини і ввели ${luckyNumber}, тому ваша картка заблокована для відновлення повідомте cvv-код зручним для вас способом`);
}
