// - Нам дано масив друзів let friends = ["Ivan", "Slavik", "Grisha", "Lera", "Ira"]; Потрібно зробити перевірку якщо
// кількість елементів у масиві більше або дорівнює 3, то виводиться повідомлення про те, що це великий масив, в якому  3 і більше елементи.
//     Інакше слід вивести на екран повідомлення про те, що це маленький масив, в якому менше 3-х елементів.
let friends = ["Ivan", "Slavik", "Grisha", "Lera", "Ira"];
if (friends.length >= 3) {
    confirm(`Це великий масив, в якому ${friends.length} елементів`);
} else {
    confirm('Це маленький масив, в якому менше 3-х елементів');
}

// - Маємо 3 числа і між ним  нам потрібно знайти те що посередині.
//     Знайти, яке з них є середнім (більше одного, але менше за інше). Перевірити, чи знаходиться перше число між двома іншими.
alert('Визначаємо яке з наступних 3-х чисел знаходиться посередині між двома іншими')
let num1 = +prompt('Перше число');
let num2 = +prompt('Друге число');
let num3 = +prompt('Третє число');
if ((num1 < num2 && num1 > num3) || (num1 > num2 && num1 < num3)) {
    console.log(num1);
} else if ((num2 > num1 && num2 < num3) || (num2 < num1 && num2 > num3)) {
    console.log(num2);
} else if ((num3 > num2 && num3 < num1) || ((num3 < num2 && num3 > num1))) {
    console.log(num3);
} else {
    console.log('Ви ввели однакові числа');
}

// - Перепишіть конструкцію if з використанням умовного оператора '?':
let result;
let a = 1;
let b = 2;
// if (a + b < 4) {
//     result = 'Мало';
// } else {
//     result = 'Багато';
// }
result = (a + b < 4) ? console.log('Мало') : console.log('Багато');

// - Маємо будь яке число від -100 , 0 , +100 потрібно перевірити яким є число: позитивним, негативним або нулем
// напишіть це тернарним оператором
let value = +prompt('Введіть число в діапазоні від -100 до 100');

let number = (value < 0) && (value >= -100) ? `Число ${value} - менше за нуль` :
    (value === 0) ? `Число ${value} - дорівнює нулю` :
        (value > 0) && (value <= 100) ? `Число ${value} - більше за нуль` :
            'Я ж просив від -100 до 100!';
alert(number);