// Сумма цифр числа
// Дано натуральное число N. Вычислите сумму его цифр.
//     При решении этой задачи нельзя использовать строки,
//     массивы ну и циклы
// Вам поможет Рекурсія)

function sumDigits(num) {
    if (num == 0) {
        return 0; // виходимо з циклу
    } else {
        let lastDigit = num % 10; // отримуємо останню цифру
        let newNum = Math.floor(num / 10);//отримуємо нове число без останньої цифри
        return lastDigit + sumDigits(newNum);// перебираємо до 0 та повертаємо сумму
    }
}

console.log(sumDigits(1234));

// пример:
//     1234 -> 10
// 879 -> 24
// 11 -> 2
