// 1. Створити масив з 10 чисел (можна використовувати Math.random Та Math.floor). Скласти результат цих чисел в змінній result.
let array = [1, 2, 3, 4, 5, 6, 7, 8, 9, 10];
let result = 0;
for (let i = 0; i < array.length; i++) {
    result += array[i];
}
console.log(result);

// 2. Створити об'єкт book з наступними полями  - назва, кількість сторінок, жанр
let book = {
    title: 'Буквар',
    pageNum: 100,
    style: 'науковий'
}
// 3. Створити об'єкт book з наступними полями  - назва, кількість сторінок, жанр, автори
book = {
    title: 'Колобок',
    pageNum: 40,
    style: 'художній',
    author: 'народна'
}

// 4. Створити маис об'єктів book з наступними полями  - назва, кількість сторінок, жанр, автори. Вивести кожну книгу як окремий об'єкт
book = [
    book1 = {
        title: 'Буквар',
        pageNum: 100,
        style: 'науковий',
        author: ''
    },
    book2 = {
        title: 'Колобок',
        pageNum: 40,
        style: 'художній',
        author: 'народна'
    }
]
console.log(book[0]);
console.log(book[1]);
// 5. Напишіть код, який вираховує площу прямокутника висотою 23см. (змінна height) та шириною 10см (змінна width).
// Значення площі зберігати в змінній s.
let height = 23;
let width = 10;
let s = height * width;
console.log(s);

// 6. Напиши код, який знаходить об'єм циліндра заввишки 10м (змінна heightC) та діаметром основи 4м (dC),
// результат помістіть у змінну v.
const p = 3.14;
let heightC = 10;
let dC = 4;
let v = p * (dC/2)**2 * heightC;
console.log(v);

// 7. У прямокутного трикутника дві сторони n (зі значенням 3) та m (зі значенням 4).
// Знайдіть гіпотенузу k за теоремою Піфагора (потрібно використовувати функцію Math.pow (число, ступінь) або оператор зведення в ступінь **).
let n = 3;
let m = 4;
let k = Math.sqrt(Math.pow(n, 2) + Math.pow(m, 2));
console.log(k);